// [프로그램 개발 과정]
// 1. 코딩(coding): C 언어(*.c), C++ 언어(*.cpp)
// 2. 컴파일(compile): 작성한 코드로 목적(객체, *.obj) 파일을 생성; VS에서는 빌드
// 3. 링크(link): 목적 파일과 라이브러리를 연결해서 실행 파일(*.exe) 생성
// 4. 실행: 디버깅 시작, 디버거하지 않고 시작

// [프로그램 버전]
// 1. Debug(디버그): 개발 단계; 버그 추적 가능
// 2. Release(릴리즈): 개발 완성; 프로그램 배포; 최종본
// [프로그램 결과물]
// 1. x64: 64비트 실행 파일(현재 쓰는 운영체제)
// 2. x86: 32비트 실행 파일(예전 운영체제 호환용)

// / 두개: 힌 즐 주석(comment)
// / 한개: 나눗셈
// (): 수학의 괄호; 함수의 입력을 정의
// {}: 코드 블록 정의
// main 함수 작성: 출력_자료형 main(입력_자료형) {...}
int main() // 프로그램의 시작점 역할을 하는 메인 함수
{
	// 실행: 메모리 확보 -> 계산(연산: CPU)
	// 메모리 확보 -> 변수 선언: 자료형 변수명(영어)
	// 자료형: char(글자), int(정수), long(long int), float(실수), double(double float), array, ...(다양한 자료 구조)
	char ch; // char 변수 선언: ch는 내가 정한 이름(이름은 알파벳과 숫자로만, 이름 시작은 알파벳으로만, 예외로 _를 알파벳처럼 취급
}